GT3/GT3/setup_TM/RANS-rngKE/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10                                  	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5.4 0 0);

boundaryField
{
    inlet      
    {
        type            fixedValue;
        value           uniform (5.4 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    lowerWall
    {
        type            fixedValue;
	value     uniform (0 0 0);
    }

    lowerSymmetry
    {
        type            slip;
    }

    upperSymmetry
    {
        type            slip;
    }

}

// ************************************************************************* //
